In [45]:
import collections
import pandas as pd
from collections import OrderedDict
# dict_list = [
#     {'name' : 'jeong', 'age' : 25, 'job' : 'engineer'},
#     {'name' : 'aeon', 'age' : 27, 'job' : 'engir'}
# ]
dict_list_1 = OrderedDict(
    [
        ('name',['a','b']),
        ('age',[25, 27]),
        ('job',['engineer','engir'])
    ]
)
#dataframe   df
df1= pd.DataFrame(dict_list_1)
 # check colume list order
# df = df[['name','age','job']] from collections import OrderedDict



dict_list_2 = [
    {'yeon',20,'SA'}
]

colume_name = ['name','age','job']

#df2 = pd.DataFrame.from_records(dict_list_2, columns= colume_name)
# df2 = pd.DataFrame.from_dict(collections.OrderedDict(dict_list_2))
# df2 = pd.DataFrame.from_dict(dict(dict_list_2)) 



df1.head()
# df2.head()

  name  age       job
0    a   25  engineer
1    b   27     engir

In [37]:

df1.head()

  name  age       job
0    a   25  engineer
1    b   27     engir

In [38]:
#df2.head()

      0   1   2
0  yeon  20  SA

In [2]:
scores1 = int(input("1-scores : "))
scores2 = int(input("2-scores : "))
scores3 = int(input("3-scores : "))
av = (scores1 + scores2 + scores3) / 3

print(f"결과값: {av:.1f}점")

# if scores1 or scores2 or scores3 > 100:
#     print("Invalid input")
#     exit()
# elif av > 80:
#     print("합격입니다")
# else:
#     print("ㄴㄴ")

결과값: 100.0점

In [18]:
import numpy as np
import pandas as pd
# 1. Create Pandas Dataframe
from IPython.display import display

# Take a 2D array as input to your DataFrame 
my_2darray = np.array([[1, 2, 3], [4, 5, 6]])
print(my_2darray.shape) # count  low, columns   ( 2  ,  3 ) 
display(pd.DataFrame(my_2darray))
# number  of row


# Take a dictionary as input to your DataFrame    setting frame name(a,b,c,...)
my_dict = {"a": ['1', '3'], "b": ['1', '2'], "c": ['2', '4']}
display(pd.DataFrame(my_dict))

# Take a DataFrame as input to your DataFrame 
# **Setting** 
# Column names
# index number of rows in your DataFrame
my_df = pd.DataFrame(data=[4,5,6,7], index=range(0,4), columns=['Name'])
display(pd.DataFrame(my_df))

# Take a Series as input to your DataFrame
my_series = pd.Series({"United Kingdom":"London", "India":"New Delhi", "United States":"Washington", "Belgium":"Brussels"})
display(pd.DataFrame(my_series))

(2, 3)

   0  1  2
0  1  2  3
1  4  5  6

   a  b  c
0  1  1  2
1  3  2  4

   Name
0     4
1     5
2     6
3     7

                         0
United Kingdom      London
India            New Delhi
United States   Washington
Belgium           Brussels

In [20]:

for x in [10,20,30]:
    print(f"d({x})")

d(10)
d(20)
d(30)

In [ ]:
while True:
    year = int(input('년도을 입력하시오(0은 종료)'))
    if not year:
        break
    month = int(input('월을 입력하시오(0은종료)'))
    if not month:
        break

    last_day = (29 if year % 400 == 0 or year % 4 == 0 and year % 100 else 28)  
            if (month==2) else (30 if month%2 else 31) 
            if (month>=8) else (31 if month%2 else 30)

    print('{0}년 {1}월의 마지막 날짜는 {2}일 입니다.'.format(year,month,last_day))

In [12]:
x = 0
print("작동합니다.\n")
for x in range(1,7):
    print(f"{x}번째 행입니다.\n")
print("종료합니다.\n")

작동합니다.

1번째 행입니다.

2번째 행입니다.

3번째 행입니다.

4번째 행입니다.

5번째 행입니다.

6번째 행입니다.

종료합니다.

In [31]:
sum = 0
for x in [80,90,85,78,82] : 
    sum +=  x
print(f"합계는 {sum}입니다.")

합계는 415입니다.

In [28]:
sum = 0
for i in range(1,101):
    sum += i
print(sum)

5050

In [43]:
import pandas as pd 
df = pd.DataFrame({'age' : [1,12,2]}, index=['one','two','three'])
df.head()

       age
one      1
two     12
three    2

In [47]:
df1 = pd.DataFrame({'age': [24, 42], 'state': ['NY', 'CA'], 'point': [64, 92]},
                  index=['Alice', 'Bob'])
# for column_name in df:
#     print(type(column_name))
#     print(column_name)
#     print('======\n')

In [73]:

for i in range(2,10):
    i += 0
    print(f"{i}단을 출력하겠습니다.")
    for y in range(1,10):
        print(i, "X", y, "=", i*y)
#print(f"{{x}} 'x' {n} = {x * num}")

2단을 출력하겠습니다.
2 X 1 = 2
2 X 2 = 4
2 X 3 = 6
2 X 4 = 8
2 X 5 = 10
2 X 6 = 12
2 X 7 = 14
2 X 8 = 16
2 X 9 = 18
3단을 출력하겠습니다.
3 X 1 = 3
3 X 2 = 6
3 X 3 = 9
3 X 4 = 12
3 X 5 = 15
3 X 6 = 18
3 X 7 = 21
3 X 8 = 24
3 X 9 = 27
4단을 출력하겠습니다.
4 X 1 = 4
4 X 2 = 8
4 X 3 = 12
4 X 4 = 16
4 X 5 = 20
4 X 6 = 24
4 X 7 = 28
4 X 8 = 32
4 X 9 = 36
5단을 출력하겠습니다.
5 X 1 = 5
5 X 2 = 10
5 X 3 = 15
5 X 4 = 20
5 X 5 = 25
5 X 6 = 30
5 X 7 = 35
5 X 8 = 40
5 X 9 = 45
6단을 출력하겠습니다.
6 X 1 = 6
6 X 2 = 12
6 X 3 = 18
6 X 4 = 24
6 X 5 = 30
6 X 6 = 36
6 X 7 = 42
6 X 8 = 48
6 X 9 = 54
7단을 출력하겠습니다.
7 X 1 = 7
7 X 2 = 14
7 X 3 = 21
7 X 4 = 28
7 X 5 = 35
7 X 6 = 42
7 X 7 = 49
7 X 8 = 56
7 X 9 = 63
8단을 출력하겠습니다.
8 X 1 = 8
8 X 2 = 16
8 X 3 = 24
8 X 4 = 32
8 X 5 = 40
8 X 6 = 48
8 X 7 = 56
8 X 8 = 64
8 X 9 = 72
9단을 출력하겠습니다.
9 X 1 = 9
9 X 2 = 18
9 X 3 = 27
9 X 4 = 36
9 X 5 = 45
9 X 6 = 54
9 X 7 = 63
9 X 8 = 72
9 X 9 = 81

In [81]:
avgs = [1 ,2 , 3, 4.5, 5.3]
for avg in avgs : 
    if avg >= 5: print(f"{avg}는 \t합격입니다.")
    else: print(f"{avg}는 \t불합격입니다.")

1는 	불합격입니다.
2는 	불합격입니다.
3는 	불합격입니다.
4.5는 	불합격입니다.
5.3는 	합격입니다.